In [ ]:
def find_pairs(arr, target):
    seen = set()
    pairs = set()
    for num in arr:
        diff = target - num
        if diff in seen:
            pairs.add((min(num, diff), max(num, diff)))
        seen.add(num)
    return list(pairs)

print(find_pairs([2, 4, 3, 7, 1, 5], 6))  # [(1, 5), (2, 4)]

In [165]:
# Combine two lists and filter out pairs where the number is even
nums = [1, 2, 3, 4]
letters = ['a', 'b', 'c', 'd']

# Combine with zip
zipped = zip(nums, letters)

# Filter pairs where the number is odd
filtered_pairs = list(filter(lambda x: x[0] % 2 != 0, zipped))
print(filtered_pairs)  # Output: [(1, 'a'), (3, 'c')]

# Transform numbers to their square using map
squared_nums = list(map(lambda x: (x[0]**2, x[1]), filtered_pairs))
print(squared_nums)  # Output: [(1, 'a'), (9, 'c')]

[(1, 'a'), (3, 'c')]
[(1, 'a'), (9, 'c')]

In [166]:
# Square each number in a list
nums = [1, 2, 3, 4, 5]

squared_nums = list(map(lambda x: x ** 2, nums))
print(squared_nums)  # Output: [1, 4, 9, 16, 25]

[1, 4, 9, 16, 25]

In [167]:
a = list(map(lambda x: x **2, nums))
a

[1, 4, 9, 16, 25]

In [171]:
# Combine two lists into a list of tuples
list1 = [1, 2, 3,4]
list2 = ['a', 'b', 'c']

zipped = list(zip(list1, list2))
print(zipped)  # Output: [(1, 'a'), (2, 'b'), (3, 'c')]

[(1, 'a'), (2, 'b'), (3, 'c')]

In [170]:
list(zip(list1, list2))

[(1, 'a'), (2, 'b'), (3, 'c')]

In [172]:
from functools import reduce

# Find the product of all numbers in a list
nums = [1, 2, 3, 4, 5]

product = reduce(lambda x, y: x * y, nums)
print(product)  # Output: 120

120

In [173]:
def max_product_of_three(nums):
    nums.sort()  # Sort the list in ascending order
    # Option 1: Product of the largest three numbers
    product1 = nums[-1] * nums[-2] * nums[-3]
    # Option 2: Product of the two smallest numbers (if negative) and the largest number
    product2 = nums[0] * nums[1] * nums[-1]
    # Return the maximum of the two options
    return max(product1, product2)

# Example usage
nums = [1, 2, 3, 4, 5, 6]
print(max_product_of_three(nums))  # Output: 120 (4 * 5 * 6)

120

In [178]:
def max_product_three(nums):
    nums.sort()
    product1 = nums[-1] * nums[-2] * nums[-3]
    com1 = nums[-1] , nums[-2] , nums[-3]
    
    product2 = nums[0] * nums[1] * nums[-1]
    com2 = nums[0] , nums[1] , nums[-1]
    
    if product1 > product2:
        return product1,com1
    else:
        return product2,com2
max_product_three(nums)

(120, (6, 5, 4))

In [205]:
def get_diagonal(matrix):
    if not matrix or not matrix[0]:
        return []
    diagonal = []
    for i in range(min(len(matrix), len(matrix[0]))):
        diagonal.append(matrix[i][i])
    return diagonal
matrix = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

diagonal = get_diagonal(matrix)
print(diagonal)

[1, 5, 9]

In [199]:
def get_diagonal(matrix):
    if not matrix or not matrix[0]:
        return []
    diagonal = []
    for i in range(min(len(matrix), len(matrix[0]))):
        diagonal.append(matrix[i][i])
    return diagonal


matrix = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

diagonal = get_diagonal(matrix)
print(diagonal)

[1, 5, 9]

In [212]:
def get_diagonal(matrix):
    if not matrix or not matrix[0]:
        return []
    diagonal = []
    for i in range(min(len(matrix),len(matrix[0]))):
        diagonal.append(matrix[i][i])
    return diagonal

def transposed(matrix):
    if not matrix:
        return []
    trans = []
    for i in range(len(matrix[0])):
        trans.append([row[i] for row in matrix])
    return trans

transposed = transposed(matrix)
for i in transposed:
    print(i)

[1, 4, 7]
[2, 5, 8]
[3, 6, 9]

In [207]:
def transpose_matrix(matrix):
    # Ensure the matrix is not empty
    if not matrix:
        return []

    # Transpose the matrix
    transposed = []
    for col in range(len(matrix[0])):  # Iterate through columns of the original matrix
        transposed.append([row[col] for row in matrix])  # Collect all elements in each column
    return transposed

transposed = transpose_matrix(matrix)
for i in transposed:
    print(i)

[1, 4, 7]
[2, 5, 8]
[3, 6, 9]

In [196]:
def get_diagonal(matrix):
    # Ensure the matrix is not empty
    if not matrix or not matrix[0]:
        return []

    diagonal = []
    for i in range(min(len(matrix), len(matrix[0]))):  # Traverse up to the smaller dimension
        diagonal.append(matrix[i][i])
    return diagonal

# Example usage
matrix = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

diagonal = get_diagonal(matrix)
print("Matrix:")
for row in matrix:
    print(row)
print("\nDiagonal:", diagonal)

Matrix:
[1, 2, 3]
[4, 5, 6]
[7, 8, 9]

Diagonal: [1, 5, 9]

In [184]:
def transpose_matrix(matrix):
    # Ensure the matrix is not empty
    if not matrix:
        return []

    # Transpose the matrix
    transposed = []
    for col in range(len(matrix[0])):  # Iterate through columns of the original matrix
        transposed.append([row[col] for row in matrix])  # Collect all elements in each column
    return transposed

# Example usage
matrix = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

transposed = transpose_matrix(matrix)

print("Original Matrix:")
for row in matrix:
    print(row)

print("\nTransposed Matrix:")
for row in transposed:
    print(row)

Original Matrix:
[1, 2, 3]
[4, 5, 6]
[7, 8, 9]

Transposed Matrix:
[1, 4, 7]
[2, 5, 8]
[3, 6, 9]

In [213]:
def max_product_three(nums):
    nums.sort()
    prod1 = nums[-1]*nums[-2]*nums[-3]
    com1 = nums[-1],nums[-2],nums[-3]
    prod2 = nums[0]*nums[1]*nums[-1]
    com2 = nums[0], nums[1], nums[-1]
    if prod1 > prod2:
        return prod1,com1
    else:
        prod2,com2
        
max_product_three([9,5,1,3,5,7])

(315, (9, 7, 5))

In [ ]:
def find_pairs(arr, target):
    seen = set()
    pairs = set()
    for num in arr:
        diff = target - num
        if diff in seen:
            pairs.add((min(num, diff), max(num, diff)))
        seen.add(num)
    return list(pairs)

print(find_pairs([2, 4, 3, 7, 1, 5], 6))

In [214]:
def find_pair(arr,target):
    seen = set()
    pairs = set()
    for num in arr:
        diff = target - num
        if diff in seen:
            pairs.add((min(num,diff), max(num,diff)))
        seen.add(num)
    return list(pairs)
print(find_pairs([2, 4, 3, 7, 1, 5], 6))

{(2, 4), (1, 5)}

In [220]:
def transposed(matrix):
    if not matrix:
        return []
    trans = []
    for i in range(len(matrix)):
        trans.append([row[i] for row in matrix])
    return trans

transposed(matrix)

[[1, 4, 7], [2, 5, 8], [3, 6, 9]]

In [221]:
def get_diagonal(matrix):
    if not matrix or not matrix[0]:
        return []
    dia = []
    for i in range(min(len(matrix), len(matrix[0]))):
        dia.append(matrix[i][i])
    return dia

get_diagonal(matrix)

[1, 5, 9]

In [225]:
def find_pairs(arr,target):
    seen = set()
    pairs = set()
    for num in arr:
        diff = target - num
        if diff in seen:
            pairs.add((min(num,diff), max(num,diff)))
        seen.add(num)
    return pairs

print(find_pairs([2, 4, 3, 7, 1, 5], 6))

{(2, 4), (1, 5)}

In [217]:
def transponsed(matrix):
    if not matrix:
        return []
    trans = []
    for i in range(len(matrix[0])):
        trans.append([row[i] for row in matrix])
    return trans

trans1 = transponsed(matrix)
for i in trans1:
    print(i)

[1, 4, 7]
[2, 5, 8]
[3, 6, 9]

In [219]:
def get_diagonal(matrix):
    if not matrix:
        return []
    diagonal = []
    for i in range(min(len(matrix), len(matrix[0]))):
        diagonal.append(matrix[i][i])
    return diagonal

dia = get_diagonal(matrix)
dia

[1, 5, 9]

In [226]:
def max_product_three(nums):
    nums.sort()
    prod1 = nums[-1]*nums[-2]*nums[-3]
    com1 = nums[-1],nums[-2],nums[-3]
    prod2 = nums[0]*nums[1]*nums[-1]
    com2 = nums[0],nums[1],nums[-1]
    if prod1 > prod2:
        return prod1,com1
    else:
        return prod2,com2
    
max_product_three([8,5,2,6,5,4])

(240, (8, 6, 5))

In [176]:
def max_product_of_three(nums):
    nums.sort()  # Sort the list in ascending order

    # Option 1: Product of the largest three numbers
    product1 = nums[-1] * nums[-2] * nums[-3]
    combination1 = (nums[-1], nums[-2], nums[-3])

    # Option 2: Product of the two smallest numbers (if negative) and the largest number
    product2 = nums[0] * nums[1] * nums[-1]
    combination2 = (nums[0], nums[1], nums[-1])

    # Compare the two options and return the larger product along with the numbers
    if product1 > product2:
        return product1, combination1
    else:
        return product2, combination2

# Example usage
nums = [1, 2, 3, 4, 5, 6]
product, numbers = max_product_of_three(nums)
print(f"Maximum Product: {product}")
print(f"Numbers: {numbers}")

Maximum Product: 120
Numbers: (6, 5, 4)

In [8]:
def longest_unique_substring(s):
    seen = {}
    start = max_length = 0
    for i , char in enumerate(s):
        if char in seen and seen[char] >= start:
            start = seen[char] + 1
        seen[char] = i
        max_length = max(max_length, i-start +1)
    return max_length

print(longest_unique_substring("abcabcbb"))

3

In [12]:
s = 'abcabcbb'
seen = {}
start = max_length = 0
for i, char in enumerate(s):
    if char in seen and seen[char] >= start:
        start = seen[char] +1
    seen[char] = i
    max_length = max(max_length, i - start +1)
print(max_length)

3

In [14]:
def find_pairs(arr,target):
    seen = set()
    pairs = set()
    for num in arr:
        diff = target - num
        if diff in  seen:
            pairs.add((min(num,diff), max(num,diff)))
        seen.add(num)
    return pairs

print(find_pairs([2, 4, 3, 7, 1, 5], 6))

{(2, 4), (1, 5)}

In [17]:
def find_pairs(arr, target):
    seen = set()
    pairs = set()
    for num in arr:
        diff = target - num
        if diff in seen:
            pairs.add((min(num,diff), max(num,diff)))
        seen.add(num)
    return pairs

print(find_pairs([2, 4, 3, 7, 1, 5], 6))

{(2, 4), (1, 5)}

In [ ]:
def longest_unique_substring(s):
    seen = {}
    start = max_length = 0
    for i, char in enumerate(s):
        if char in seen and seen[char] >= start:
            start = seen[char] + 1
        seen[char] = i
        max_length = max(max_length, i - start + 1)
    return max_length

print(longest_unique_substring("abcabcbb"))  # 3 ("abc")

In [24]:
def largest_unique_substring(s):
    seen = {}
    start = max_length = 0
    for i,char in enumerate(s):
        if char in seen and seen[char] >= start:
            start = seen[char] +1
        seen[char] = i
        max_length = max(max_length, i-start+2)
    return max_length

print(longest_unique_substring("abcabcbb"))  # 3 ("abc")

3

In [ ]:
def is_armstrong(num):
    digits = list(map(int, str(num)))
    return num == sum(d ** len(digits) for d in digits)

print(is_armstrong(153))  # True
print(is_armstrong(123))  # False

In [ ]:
def pascal_triangle(n):
    result = [[1]]
    for i in range(1, n):
        row = [1]
        for j in range(1, i):
            row.append(result[i-1][j-1] + result[i-1][j])
        row.append(1)
        result.append(row)
    return result

print(pascal_triangle(5))

In [ ]:
def subsets(nums):
    result = [[]]
    for num in nums:
        result += [curr + [num] for curr in result]
    return result

print(subsets([1, 2, 3]))
# [[], [1], [2], [1, 2], [3], [1, 3], [2, 3], [1, 2, 3]]

In [19]:
def subsets(nums):
    result = [[]]
    for i in nums:
        result += [curr + [i] for curr in result]
    return result

print(subsets([1,2,3,4]))

[[], [1], [2], [1, 2], [3], [1, 3], [2, 3], [1, 2, 3], [4], [1, 4], [2, 4], [1, 2, 4], [3, 4], [1, 3, 4], [2, 3, 4], [1, 2, 3, 4]]

In [22]:
def count_inv(arr):
    inv = 0
    for i in range(len(arr)):
        for j in range(i+1,len(arr)):
            if arr[i] > arr[j]:
                inv+=1
    return inv

count_inv([8,4,2,1])

6

In [20]:
def count_inversions(arr):
    inversions = 0
    for i in range(len(arr)):
        for j in range(i+1, len(arr)):
            if arr[i] > arr[j]:
                inversions += 1
    return inversions

print(count_inversions([8, 4, 2, 1]))  # 6

6

In [ ]:
def majority_element(nums):
    count = 0
    candidate = None
    for num in nums:
        if count == 0:
            candidate = num
        count += (1 if num == candidate else -1)
    return candidate

print(majority_element([3, 3, 4, 2, 4, 4, 2, 4, 4]))  # 4

In [23]:
def find_pairs(arr,target):
    seen = set()
    pairs = set()
    for num in  arr:
        diff = target - num
        if diff in seen:
            pairs.add((min(num,diff), max(num,diff)))
        seen.add(num)
    return pairs

find_pairs([1,2,3,4,5,9,2],7)

{(2, 5), (3, 4)}

In [116]:
# import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
}

df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [85]:
df[df['Age'] > 30]

      Name  Age     City
2  Charlie   35  Chicago

In [86]:
df['Salary'] = 5000
df

      Name  Age         City  Salary
0    Alice   25     New York    5000
1      Bob   30  Los Angeles    5000
2  Charlie   35      Chicago    5000

In [87]:
df.drop(columns=['Salary'],axis=1,inplace=True)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [88]:
df.groupby('City')['Age'].mean()

City
Chicago        35.0
Los Angeles    30.0
New York       25.0
Name: Age, dtype: float64

In [61]:
df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['Alice', 'Bob']})
df2 = pd.DataFrame({'ID': [1, 2], 'Score': [85, 90]})

merged_df = pd.merge(df1, df2, on='ID')
print(merged_df)

   ID   Name  Score
0   1  Alice     85
1   2    Bob     90

In [62]:
merge = pd.merge(df1,df2,on='ID')
merge

   ID   Name  Score
0   1  Alice     85
1   2    Bob     90

In [63]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [117]:
import numpy as np
df['Salary'] = [5,np.nan, 8]

In [118]:
df

      Name  Age         City  Salary
0    Alice   25     New York     5.0
1      Bob   30  Los Angeles     NaN
2  Charlie   35      Chicago     8.0

In [119]:
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())
df

      Name  Age         City  Salary
0    Alice   25     New York     5.0
1      Bob   30  Los Angeles     6.5
2  Charlie   35      Chicago     8.0

In [120]:
sorted_df = df.sort_values(by='Age',ascending=False)
sorted_df

      Name  Age         City  Salary
2  Charlie   35      Chicago     8.0
1      Bob   30  Los Angeles     6.5
0    Alice   25     New York     5.0

In [93]:
sor = df.sort_values(by='Age', ascending=True)
sor

      Name  Age         City  Salary
0    Alice   25     New York     5.0
1      Bob   30  Los Angeles     6.5
2  Charlie   35      Chicago     8.0

In [46]:
# df['Date'] = pd.to_datetime(df['Date'])
# df['Year'] = df['Date'].dt.year
# print(df)

In [47]:
df = df.rename(columns={'Name': 'Full Name'})
print(df)

  Full Name  Age         City  Salary
0     Alice   25     New York     5.0
1       Bob   30  Los Angeles     6.5
2   Charlie   35      Chicago     8.0

In [94]:
df = df.rename(columns={'Name':'Full Name'})
df

  Full Name  Age         City  Salary
0     Alice   25     New York     5.0
1       Bob   30  Los Angeles     6.5
2   Charlie   35      Chicago     8.0

In [ ]:
df.loc(len(df))

In [49]:
df = df.rename(columns={'Full Name':'Name'})
df

      Name  Age         City  Salary
0    Alice   25     New York     5.0
1      Bob   30  Los Angeles     6.5
2  Charlie   35      Chicago     8.0

In [51]:
df['City'].unique()

array(['New York', 'Los Angeles', 'Chicago'], dtype=object)

In [52]:
df['Age'].apply(lambda x: x*2)

0    50
1    60
2    70
Name: Age, dtype: int64

In [54]:
arrays = [['A', 'A', 'B', 'B'], [1, 2, 1, 2]]
df = pd.DataFrame({'Value': [10, 20, 30, 40]}, index=arrays)
df.index.names = ['Group', 'Index']
(df)

             Value
Group Index
A     1         10
      2         20
B     1         30
      2         40

In [67]:
df['RollingAvg'] = df['Salary'].rolling(window=2).mean()
print(df)

      Name  Age         City  Salary  RollingAvg
0    Alice   25     New York     5.0         NaN
1      Bob   30  Los Angeles     6.5        5.75
2  Charlie   35      Chicago     8.0        7.25

In [68]:
df['City'] = df['City'].replace('New York','NYC')
df

      Name  Age         City  Salary  RollingAvg
0    Alice   25          NYC     5.0         NaN
1      Bob   30  Los Angeles     6.5        5.75
2  Charlie   35      Chicago     8.0        7.25

In [69]:
df['City'] = df['City'].replace('NYC','New York')
df

      Name  Age         City  Salary  RollingAvg
0    Alice   25     New York     5.0         NaN
1      Bob   30  Los Angeles     6.5        5.75
2  Charlie   35      Chicago     8.0        7.25

In [70]:
df = df.drop_duplicates()

      Name  Age         City  Salary  RollingAvg
0    Alice   25     New York     5.0         NaN
1      Bob   30  Los Angeles     6.5        5.75
2  Charlie   35      Chicago     8.0        7.25

In [121]:
# Add a single row using loc
df.loc[len(df)] = ["David", 28, "Houston", 7.0,]
df

      Name  Age         City  Salary
0    Alice   25     New York     5.0
1      Bob   30  Los Angeles     6.5
2  Charlie   35      Chicago     8.0
3    David   28      Houston     7.0

In [122]:
df

      Name  Age         City  Salary
0    Alice   25     New York     5.0
1      Bob   30  Los Angeles     6.5
2  Charlie   35      Chicago     8.0
3    David   28      Houston     7.0

In [123]:
df.loc[len(df)] = ['Ajit',28,'Bhandara',9.1]
df

      Name  Age         City  Salary
0    Alice   25     New York     5.0
1      Bob   30  Los Angeles     6.5
2  Charlie   35      Chicago     8.0
3    David   28      Houston     7.0
4     Ajit   28     Bhandara     9.1

In [124]:
df.loc[len(df)] = ['Madame',28,'Bhandara',9]
df

      Name  Age         City  Salary
0    Alice   25     New York     5.0
1      Bob   30  Los Angeles     6.5
2  Charlie   35      Chicago     8.0
3    David   28      Houston     7.0
4     Ajit   28     Bhandara     9.1
5   Madame   28     Bhandara     9.0

In [101]:
df = df.rename(columns={'Full Name':'Name'})
df

      Name  Age         City  Salary
0    Alice   25     New York     5.0
1      Bob   30  Los Angeles     6.5
2  Charlie   35      Chicago     8.0
3     Ajit   28     Bhandara     9.1
4   Madame   28     Bhandara     9.0

In [125]:
df.groupby('City')['Age'].apply(lambda x: x.mode()[0])
df

      Name  Age         City  Salary
0    Alice   25     New York     5.0
1      Bob   30  Los Angeles     6.5
2  Charlie   35      Chicago     8.0
3    David   28      Houston     7.0
4     Ajit   28     Bhandara     9.1
5   Madame   28     Bhandara     9.0

In [126]:
# Define the rows to be added as a list of dictionaries
rows_to_add = [
    {"Name": "David", "Age": 28, "City": "Houston", "Salary": 7.0},
    {"Name": "Eve", "Age": 32, "City": "San Francisco", "Salary": 9.0},
    {"Name": "Frank", "Age": 29, "City": "Austin", "Salary": 6.8},
]

# Append each row to the DataFrame
for row in rows_to_add:
    df = pd.concat([df, pd.DataFrame([row])], ignore_index=True)

print(df)

      Name  Age           City  Salary
0    Alice   25       New York     5.0
1      Bob   30    Los Angeles     6.5
2  Charlie   35        Chicago     8.0
3    David   28        Houston     7.0
4     Ajit   28       Bhandara     9.1
5   Madame   28       Bhandara     9.0
6    David   28        Houston     7.0
7      Eve   32  San Francisco     9.0
8    Frank   29         Austin     6.8

In [127]:
new_row = [
    {'Name':'Ajit','Age':28,'City':'Bhandara','Salary':9},
    {'Name':'Ajit','Age':28,'City':'Bhandara','Salary':9}
]

for row in new_row:
    df = pd.concat([df,pd.DataFrame([row])], ignore_index=True)
df

       Name  Age           City  Salary
0     Alice   25       New York     5.0
1       Bob   30    Los Angeles     6.5
2   Charlie   35        Chicago     8.0
3     David   28        Houston     7.0
4      Ajit   28       Bhandara     9.1
5    Madame   28       Bhandara     9.0
6     David   28        Houston     7.0
7       Eve   32  San Francisco     9.0
8     Frank   29         Austin     6.8
9      Ajit   28       Bhandara     9.0
10     Ajit   28       Bhandara     9.0

In [128]:
df.loc[len(df)] = ['Sujit',28,'Bhandara',8]
df

       Name  Age           City  Salary
0     Alice   25       New York     5.0
1       Bob   30    Los Angeles     6.5
2   Charlie   35        Chicago     8.0
3     David   28        Houston     7.0
4      Ajit   28       Bhandara     9.1
5    Madame   28       Bhandara     9.0
6     David   28        Houston     7.0
7       Eve   32  San Francisco     9.0
8     Frank   29         Austin     6.8
9      Ajit   28       Bhandara     9.0
10     Ajit   28       Bhandara     9.0
11    Sujit   28       Bhandara     8.0

In [129]:
df.groupby('City')['Age'].apply(lambda x:x.mode()[0])

City
Austin           29
Bhandara         28
Chicago          35
Houston          28
Los Angeles      30
New York         25
San Francisco    32
Name: Age, dtype: int64

In [130]:
df

       Name  Age           City  Salary
0     Alice   25       New York     5.0
1       Bob   30    Los Angeles     6.5
2   Charlie   35        Chicago     8.0
3     David   28        Houston     7.0
4      Ajit   28       Bhandara     9.1
5    Madame   28       Bhandara     9.0
6     David   28        Houston     7.0
7       Eve   32  San Francisco     9.0
8     Frank   29         Austin     6.8
9      Ajit   28       Bhandara     9.0
10     Ajit   28       Bhandara     9.0
11    Sujit   28       Bhandara     8.0

In [131]:
duplicate = df[df.duplicated()]
duplicate

     Name  Age      City  Salary
6   David   28   Houston     7.0
10   Ajit   28  Bhandara     9.0

In [133]:
# Find duplicates based on 'Name' and 'Age' columns
duplicates = df[df.duplicated(subset=["Name", "Age"])]
(duplicates)

     Name  Age      City  Salary
6   David   28   Houston     7.0
9    Ajit   28  Bhandara     9.0
10   Ajit   28  Bhandara     9.0

In [134]:
# Count duplicate rows
duplicate_count = df.duplicated().sum()
print(f"Number of duplicate rows: {duplicate_count}")

Number of duplicate rows: 2

In [135]:
df

       Name  Age           City  Salary
0     Alice   25       New York     5.0
1       Bob   30    Los Angeles     6.5
2   Charlie   35        Chicago     8.0
3     David   28        Houston     7.0
4      Ajit   28       Bhandara     9.1
5    Madame   28       Bhandara     9.0
6     David   28        Houston     7.0
7       Eve   32  San Francisco     9.0
8     Frank   29         Austin     6.8
9      Ajit   28       Bhandara     9.0
10     Ajit   28       Bhandara     9.0
11    Sujit   28       Bhandara     8.0

In [140]:
# Filter columns whose names contain the letter 'a' (case-insensitive)
filtered_columns = df.filter(like='a', axis=1)
print(filtered_columns)

       Name  Salary
0     Alice     5.0
1       Bob     6.5
2   Charlie     8.0
3     David     7.0
4      Ajit     9.1
5    Madame     9.0
6     David     7.0
7       Eve     9.0
8     Frank     6.8
9      Ajit     9.0
10     Ajit     9.0
11    Sujit     8.0

In [141]:
# Filter rows where Age is greater than 28
filtered_rows = df.loc[lambda x: x['Age'] > 28]
print(filtered_rows)

      Name  Age           City  Salary
1      Bob   30    Los Angeles     6.5
2  Charlie   35        Chicago     8.0
7      Eve   32  San Francisco     9.0
8    Frank   29         Austin     6.8

In [142]:
# Filter rows where Age > 28 and columns containing the letter 'a'
filtered = df.loc[lambda x: x['Age'] > 28, df.filter(like='a').columns]
print(filtered)

      Name  Salary
1      Bob     6.5
2  Charlie     8.0
7      Eve     9.0
8    Frank     6.8

In [113]:
df.groupby('Name')['City'].apply(lambda x:x.mode()[0])

Name
Ajit            Bhandara
Alice           New York
Bob          Los Angeles
Charlie          Chicago
David            Houston
Eve        San Francisco
Frank             Austin
Madame          Bhandara
Sujit           Bhandara
Name: City, dtype: object

In [114]:
import pandas as pd

# Sample DataFrame
data = {
    "Name": ["Alice", "Bob", "Charlie", "Alice", "Eve", "Charlie"],
    "Age": [25, 30, 35, 25, 32, 35],
    "City": ["New York", "Los Angeles", "Chicago", "New York", "Austin", "Chicago"]
}

df = pd.DataFrame(data)

# Find duplicate rows
duplicates = df[df.duplicated()]
print(duplicates)

      Name  Age      City
3    Alice   25  New York
5  Charlie   35   Chicago

In [77]:
# import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank"],
    "City": ["NYC", "NYC", "Chicago", "Chicago", "LA", "LA"],
    "Salary": [70000, 80000, 60000, 90000, 75000, 85000]
}

df = pd.DataFrame(data)

# Find the top 3 salaries for each city
top_salaries = df.groupby('City').apply(lambda x: x.nlargest(3, 'Salary')).reset_index(drop=True)
top_salaries

C:\Users\ASUS\AppData\Local\Temp\ipykernel_15796\23164260.py:12: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  top_salaries = df.groupby('City').apply(lambda x: x.nlargest(3, 'Salary')).reset_index(drop=True)

      Name     City  Salary
0    David  Chicago   90000
1  Charlie  Chicago   60000
2    Frank       LA   85000
3      Eve       LA   75000
4      Bob      NYC   80000
5    Alice      NYC   70000

In [78]:
top = df.groupby('City').apply(lambda x:x.nlargest(3,'Salary')).reset_index(drop=True)
top

C:\Users\ASUS\AppData\Local\Temp\ipykernel_15796\668672122.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  top = df.groupby('City').apply(lambda x:x.nlargest(3,'Salary')).reset_index(drop=True)

      Name     City  Salary
0    David  Chicago   90000
1  Charlie  Chicago   60000
2    Frank       LA   85000
3      Eve       LA   75000
4      Bob      NYC   80000
5    Alice      NYC   70000

In [79]:
data = {"Status": [1, 1, 0, 1, 1, 1, 0, 1]}
df = pd.DataFrame(data)

# Add a column to count consecutive 1s
df['Group'] = (df['Status'] != df['Status'].shift()).cumsum()
consecutive_ones = df[df['Status'] == 1].groupby('Group').size().max()
print(consecutive_ones)

3

In [80]:
data = {
    "City": ["NYC", "NYC", "LA", "LA", "LA"],
    "Product": ["A", "B", "A", "A", "B"]
}

df = pd.DataFrame(data)

# Find the most frequent product in each city
most_frequent = df.groupby('City')['Product'].apply(lambda x: x.mode()[0])
print(most_frequent)

City
LA     A
NYC    A
Name: Product, dtype: object

In [82]:
most = df.groupby('City')['Product'].apply(lambda x: x.mode()[0])
most

City
LA     A
NYC    A
Name: Product, dtype: object

In [83]:
data = {"Values": [10, 20, 30, 40, 50, 60]}
df = pd.DataFrame(data)

# Calculate rolling standard deviation
df['RollingStd'] = df['Values'].rolling(window=3).std()
print(df)

   Values  RollingStd
0      10         NaN
1      20         NaN
2      30        10.0
3      40        10.0
4      50        10.0
5      60        10.0

In [1]:
def find_duplicates(arr):
    seen = set()
    duplicates = set()
    
    for num in arr:
        if num in seen:
            duplicates.add(num)
        else:
            seen.add(num)
    
    return list(duplicates)

# Example usage
input_array = [1, 2, 3, 1, 3, 6, 5]
print(find_duplicates(input_array))

[1, 3]

In [1]:
def remove_dup(lis):
    lis.sort()
    i=1
    while i < len(lis):
        if lis[i] == lis[i-1]:
            del lis[i]
        else:
            i+=1
    return lis

remove_dup([5,1,2,3,4,5,1,2,3])

[1, 2, 3, 4, 5]

In [2]:
def prime(n):
    if n <=0:
        return False
    for i in range(2,n):
        if n % i == 0:
            return False
    return True

prime(17)

True

In [3]:
def merge_two_list(lis1,lis2):
    merge_list = []
    i,j=0,0
    while i < len(lis1) and j < len(lis2):
        if lis1[i] < lis2[j]:
            merge_list.append(lis1[i])
            i+=1
        else:
            merge_list.append(lis2[j])
    merge_list.extend(lis1[i:])
    merge_list.extend(lis2[j:])
    return merge_list

merge_two_list([1,2,3],[4,5,6])

[1, 2, 3, 4, 5, 6]

In [4]:
def flatten_list(nested_list):
    flat_list=[]
    for i in nested_list:
        if isinstance(i,list):
            flat_list.extend(flatten_list(i))
        else:
            flat_list.append(i)
    return flat_list

flatten_list([1,2,[3,4,[8,9,[6,4]]]])

[1, 2, 3, 4, 8, 9, 6, 4]

In [6]:
s= 'rotator'
def polli(s):
    return s[::-1] == s
for i in range(1,len(s)+1):
    start = 0
    end = i
    while end < len(s)+1:
        if polli(s[start:end]):
            print(s[start:end])
        start+=1
        end +=1

r
o
t
a
t
o
r
tat
otato
rotator

In [7]:
def factorial(n):
    if n == 0:
        return 1
    return n * factorial(n-1)
factorial(5)

120

In [10]:
def fact(n):
    if n == 0:
        return 1
    return n*fact(n-1)
fact(5)

120

In [11]:
def fibo(n):
    seq=[0,1]
    while len(seq) < n:
        seq.append(seq[-1]+seq[-2])
    return seq

fibo(10)

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [12]:
def upper_string(s):
    result = ''
    st = s.lower()
    for i in range(len(st)):
        if i == 0 or i == 4:
            result+= st[-(i+1)].upper()
        else:
            result += st[-(i+1)]
    return result

upper_string('macdonald')

'DlanOdcam'

In [13]:
lis = [11,22,33,44]
smallest = second_smallest = float('inf')
for i in lis:
    if i < smallest:
        smallest,second_smallest = i,smallest
    elif i < second_smallest:
        second_smallest = i
print(second_smallest)

22

In [18]:
second_largest = largest = 0
for i in lis:
    if i > largest:
        second_largest = largest
        largest = i
    elif i > second_largest and i != largest:
        second_largest = i
print(second_largest)

33

In [6]:
seen = set()
duplicate = set()

for num in input_array:
    if num in seen:
        duplicate.add(num)
    else:
        seen.add(num)

In [7]:
duplicate

{1, 3}

In [8]:
seen

{1, 2, 3, 5, 6}

In [ ]:
#Q3: Given an integer array, return the maximum product of any three numbers in the array?

In [9]:
input_array

[1, 2, 3, 1, 3, 6, 5]

In [10]:
def max_product_of_three(nums):
    # Sort the array
    nums.sort()
    
    # Compute the maximum product of the three largest numbers
    max1 = nums[-1] * nums[-2] * nums[-3]
    
    # Compute the maximum product of the two smallest numbers and the largest number
    max2 = nums[0] * nums[1] * nums[-1]
    
    # Return the maximum of the two computed products
    return max(max1, max2)

# Example usage
input_array = [1, 10, -5, 1, -100]
print(max_product_of_three(input_array))

5000

In [12]:
num = input_array
num.sort()
max1 = num[-1]*num[-2]*num[-3]
max2 = num[0]*num[1]*num[-1]
max(max1,max2)

5000

In [ ]:
#Q4: Given an integer array, find the sum of the largest contiguous subarray within the array. 
#For example, given the array A = [0,-1,-5,-2,3,14] it should return 17 
#because of [3,14]. Note that if all the elements are negative it should return zero.

In [ ]:
def max_subarray(arr):
  n = len(arr)
  max_sum = arr[0] #max
  curr_sum = 0 
  for i in range(n):
    curr_sum += arr[i]
    max_sum = max(max_sum, curr_sum)
    if curr_sum <0:
      curr_sum  = 0
  return max_sum

In [14]:
def max_subarry(arr):
    n = len(arr)
    max_sum = arr[0]
    curr_sum = 0
    for i in range(n):
        curr_sum += arr[i]
        max_sum = max(max_sum, curr_sum)
        if curr_sum <0:
            curr_sum = 0
    return max_sum

In [16]:
max_subarry(input_array)

17

In [15]:
def max_contiguous_subarray_sum(arr):
    if not arr:
        return 0
    
    # Initialize variables
    max_current = max_global = 0
    
    for num in arr:
        max_current = max(num, max_current + num)
        max_global = max(max_global, max_current)
    
    return max_global

# Example usage
input_array = [0, -1, -5, -2, 3, 14]
print(max_contiguous_subarray_sum(input_array))

17

In [19]:
def max1(arr):
    if not arr:
        return 0

    max_current = max_global = 0
    for num in arr:
        max_current = max(num,max_current + num)
        max_global = max(max_global,max_current)
#         print(max_global)
    return max_global

In [20]:
max1(input_array)

17

In [21]:
import pandas as pd
import numpy as np

def euclidean_distance(series1, series2):
    # Ensure both series are of the same length
    if len(series1) != len(series2):
        raise ValueError("Series must be of the same length")
    
    # Compute the Euclidean distance
    distance = np.sqrt(np.sum((series1 - series2) ** 2))
    return distance

# Example usage
series1 = pd.Series([1, 2, 3])
series2 = pd.Series([4, 5, 6])

print(euclidean_distance(series1, series2))

5.196152422706632

In [26]:
import itertools

def combinations(n, k):
    # Generate the range of numbers from 1 to n
    numbers = range(1, n + 1)
    
    # Use itertools.combinations to generate all combinations of k numbers
    return list(itertools.combinations(numbers, k))

# Example usage
n = 3
k = 2
print(combinations(n, k))

[(1, 2), (1, 3), (2, 3)]

In [27]:
def com(n,k):
    num = range(1,n+1)
    return list(itertools.combinations(num,k))

print(com(n,k))

[(1, 2), (1, 3), (2, 3)]

In [28]:
import itertools

def find_combinations_with_sum(arr, target_sum):
    result = []
    
    # Find all possible combinations of any length
    for r in range(1, len(arr) + 1):
        for combo in itertools.combinations(enumerate(arr), r):
            indices, values = zip(*combo)  # Separate indices and values
            if sum(values) == target_sum:
                result.append((indices, values))
    
    return result

def retrieve_index_and_values(arr, target_sum):
    combinations = find_combinations_with_sum(arr, target_sum)
    
    indices_list = []
    values_list = []
    
    for indices, values in combinations:
        indices_list.append(list(indices))
        values_list.append(list(values))
    
    return indices_list, values_list

# Example usage
arr = [2, 3, 5, 4, 1, 2]
target_sum = 9
indices_list, values_list = retrieve_index_and_values(arr, target_sum)

print("Indices List:", indices_list)
print("Values List:", values_list)

Indices List: [[2, 3], [0, 1, 3], [0, 2, 5], [1, 2, 4], [1, 3, 5], [0, 3, 4, 5]]
Values List: [[5, 4], [2, 3, 4], [2, 5, 2], [3, 5, 1], [3, 4, 2], [2, 4, 1, 2]]

In [2]:
import pandas as pd

# Creating a DataFrame from a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [4]:
ages = df['Age']
select_col = df[['Name','City']]
select_col

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [5]:
yong_pe = df[df['Age'] < 30]
yong_pe

    Name  Age      City
0  Alice   25  New York

In [163]:
df

       Name  Age           City  Salary
0     Alice   25       New York     5.0
1       Bob   30    Los Angeles     6.5
2   Charlie   35        Chicago     8.0
3     David   28        Houston     7.0
4      Ajit   28       Bhandara     9.1
5    Madame   28       Bhandara     9.0
6     David   28        Houston     7.0
7       Eve   32  San Francisco     9.0
8     Frank   29         Austin     6.8
9      Ajit   28       Bhandara     9.0
10     Ajit   28       Bhandara     9.0
11    Sujit   28       Bhandara     8.0

In [164]:
df[df['City']=='Bhandara']

      Name  Age      City  Salary
4     Ajit   28  Bhandara     9.1
5   Madame   28  Bhandara     9.0
9     Ajit   28  Bhandara     9.0
10    Ajit   28  Bhandara     9.0
11   Sujit   28  Bhandara     8.0

In [30]:
# Select a column
ages = df['Age']

# Select multiple columns
selected_columns = df[['Name', 'City']]

# Filter rows based on a condition
young_people = df[df['Age'] < 30]

print(ages)
print(selected_columns)
print(young_people)

0    25
1    30
2    35
Name: Age, dtype: int64
      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
    Name  Age      City
0  Alice   25  New York

In [7]:
# Create a DataFrame with missing values
data = {
    'Name': ['Alice', 'Bob', None],
    'Age': [25, None, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

# Fill missing values with a specific value
df_filled = df.fillna({'Name': 'Unknown', 'Age': 0})

# Drop rows with missing values
df_dropped = df.dropna()

print(df_filled)
print(df_dropped)

      Name   Age         City
0    Alice  25.0     New York
1      Bob   0.0  Los Angeles
2  Unknown  35.0      Chicago
    Name   Age      City
0  Alice  25.0  New York

In [8]:
df

    Name   Age         City
0  Alice  25.0     New York
1    Bob   NaN  Los Angeles
2   None  35.0      Chicago

In [9]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [10]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [13]:
# # Group by 'City' and calculate the mean age
# grouped = df.groupby('City').mean()

# print(grouped)

In [50]:
group = df.groupby('City').mean()
group

              Age
City
Chicago      35.0
Los Angeles  30.0
New York     25.0

In [43]:
# Sort by 'Age' in descending order
sorted_df = df.sort_values(by='Age', ascending=False)

# Add a ranking column based on 'Age'
df['Rank'] = df['Age'].rank()

print(sorted_df)
print(df)

    Name   Age         City
2   None  35.0      Chicago
1    Bob  30.0  Los Angeles
0  Alice  25.0     New York
    Name   Age         City  Rank
0  Alice  25.0     New York   1.0
1    Bob  30.0  Los Angeles   2.0
2   None  35.0      Chicago   3.0

In [51]:
sort_df = df.sort_values(by='Age',ascending=False)
sort_df

    Name   Age         City
2   None  35.0      Chicago
1    Bob  30.0  Los Angeles
0  Alice  25.0     New York

In [52]:
df['Rank'] = df['Age'].rank()
df

    Name   Age         City  Rank
0  Alice  25.0     New York   1.0
1    Bob  30.0  Los Angeles   2.0
2   None  35.0      Chicago   3.0

In [58]:
# Create a DataFrame with datetime data
data = {
    'Date': ['2024-01-01', '2024-02-01', '2024-03-01'],
    'Value': [10, 20, 30]
}
df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])


# # Extract year and month from the 'Date' column
# df['Year'] = df['Date'].dt.year
# df['Month'] = df['Date'].dt.month

print(df)

        Date  Value
0 2024-01-01     10
1 2024-02-01     20
2 2024-03-01     30

In [61]:
df['Date'] = pd.to_datetime(df['Date'])

df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month
df

        Date  Value  Year  Month
0 2024-01-01     10  2024      1
1 2024-02-01     20  2024      2
2 2024-03-01     30  2024      3

In [57]:
df

        Date  Value  Year  Month
0 2024-01-01     10  2024      1
1 2024-02-01     20  2024      2
2 2024-03-01     30  2024      3

In [143]:
import pandas as pd

# Sample Data
data = {
    'Name': ['John', 'Sara', 'Alice', 'Bob', 'John', 'Sara', 'Alice', 'Bob'],
    'Department': ['Sales', 'Sales', 'HR', 'HR', 'Sales', 'Sales', 'HR', 'HR'],
    'Month': ['Jan', 'Jan', 'Jan', 'Jan', 'Feb', 'Feb', 'Feb', 'Feb'],
    'Sales': [200, 150, 0, 0, 210, 160, 0, 0],
    'Performance': ['Good', 'Average', None, None, 'Good', 'Average', None, None]
}

# Creating DataFrame
df1 = pd.DataFrame(data)

# Add the 'Sales_category' column based on the condition
df1['Sales_category'] = df1['Sales'].apply(lambda x: 'Good' if x > 170 else 'Bad')

# Display the updated DataFrame
df1

    Name Department Month  Sales Performance Sales_category
0   John      Sales   Jan    200        Good           Good
1   Sara      Sales   Jan    150     Average            Bad
2  Alice         HR   Jan      0        None            Bad
3    Bob         HR   Jan      0        None            Bad
4   John      Sales   Feb    210        Good           Good
5   Sara      Sales   Feb    160     Average            Bad
6  Alice         HR   Feb      0        None            Bad
7    Bob         HR   Feb      0        None            Bad

In [146]:
df1['sale_cat'] = df1['Sales'].apply(lambda x: 'Good' if x > 170 else 'Bad')
df1

    Name Department Month  Sales Performance Sales_category sale_cat
0   John      Sales   Jan    200        Good           Good     Good
1   Sara      Sales   Jan    150     Average            Bad      Bad
2  Alice         HR   Jan      0        None            Bad      Bad
3    Bob         HR   Jan      0        None            Bad      Bad
4   John      Sales   Feb    210        Good           Good     Good
5   Sara      Sales   Feb    160     Average            Bad      Bad
6  Alice         HR   Feb      0        None            Bad      Bad
7    Bob         HR   Feb      0        None            Bad      Bad

In [157]:
# filter1 = df.groupby('Department').filter(lambda x:x['Sales'].sum() > 400)
fil = df1.groupby('Department').filter(lambda x:x['Sales'].sum() > 400)
fil

   Name Department Month  Sales Performance Sales_category sale_cat
0  John      Sales   Jan    200        Good           Good     Good
1  Sara      Sales   Jan    150     Average            Bad      Bad
4  John      Sales   Feb    210        Good           Good     Good
5  Sara      Sales   Feb    160     Average            Bad      Bad

In [158]:
df1.drop(columns=['sale_cat','Sales_category'],axis= 1,inplace=True)

In [160]:
df1

    Name Department Month  Sales Performance
0   John      Sales   Jan    200        Good
1   Sara      Sales   Jan    150     Average
2  Alice         HR   Jan      0        None
3    Bob         HR   Jan      0        None
4   John      Sales   Feb    210        Good
5   Sara      Sales   Feb    160     Average
6  Alice         HR   Feb      0        None
7    Bob         HR   Feb      0        None

In [161]:
df1['Sale_cate'] = df1['Sales'].apply(lambda x:'Good' if x > 170 else 'Bad')
df1

    Name Department Month  Sales Performance Sale_cate
0   John      Sales   Jan    200        Good      Good
1   Sara      Sales   Jan    150     Average       Bad
2  Alice         HR   Jan      0        None       Bad
3    Bob         HR   Jan      0        None       Bad
4   John      Sales   Feb    210        Good      Good
5   Sara      Sales   Feb    160     Average       Bad
6  Alice         HR   Feb      0        None       Bad
7    Bob         HR   Feb      0        None       Bad

In [162]:
fil = df1.groupby('Department').filter(lambda x:x['Sales'].sum() > 400)
fil

   Name Department Month  Sales Performance Sale_cate
0  John      Sales   Jan    200        Good      Good
1  Sara      Sales   Jan    150     Average       Bad
4  John      Sales   Feb    210        Good      Good
5  Sara      Sales   Feb    160     Average       Bad

In [ ]:
df['sales_cate'] = df['Sales'].apply(lambda x: 'Good' if x > 170 else 'Bad')

In [16]:
df['Performance'] = df['Performance'].fillna(df['Performance'].mode()[0])

In [17]:
df

    Name Department Month  Sales Performance Sales_category
0   John      Sales   Jan    200        Good           Good
1   Sara      Sales   Jan    150     Average            Bad
2  Alice         HR   Jan      0     Average            Bad
3    Bob         HR   Jan      0     Average            Bad
4   John      Sales   Feb    210        Good           Good
5   Sara      Sales   Feb    160     Average            Bad
6  Alice         HR   Feb      0     Average            Bad
7    Bob         HR   Feb      0     Average            Bad

In [18]:
# Group by Department and calculate total Sales
grouped = df.groupby('Department')['Sales'].sum()
print(grouped)

Department
HR         0
Sales    720
Name: Sales, dtype: int64

In [20]:
gr = df.groupby('Department')['Sales'].sum()
gr

Department
HR         0
Sales    720
Name: Sales, dtype: int64

In [154]:
df1.groupby('Department')['Sales'].sum()

Department
HR         0
Sales    720
Name: Sales, dtype: int64

In [21]:
gr1 = df.groupby(['Name','Department'])['Sales'].sum()
gr1

Name   Department
Alice  HR              0
Bob    HR              0
John   Sales         410
Sara   Sales         310
Name: Sales, dtype: int64

In [19]:
# Group by both Name and Department, and sum the Sales
grouped = df.groupby(['Name', 'Department'])['Sales'].sum()
print(grouped)

Name   Department
Alice  HR              0
Bob    HR              0
John   Sales         410
Sara   Sales         310
Name: Sales, dtype: int64

In [ ]:
# Calculate the average Sales for each Department
average_sales = df.groupby('Department')['Sales'].mean()
print(average_sales)

In [23]:
gr = df.groupby('Department')['Sales'].agg(['sum','mean','count'])
gr

            sum   mean  count
Department
HR            0    0.0      4
Sales       720  180.0      4

In [ ]:
# Group by Department and apply multiple aggregations to Sales
grouped = df.groupby('Department')['Sales'].agg(['sum', 'mean', 'count'])
print(grouped)

In [ ]:
# Resetting the index
grouped_df = df.groupby('Department')['Sales'].sum().reset_index()
print(grouped_df)

In [26]:
fil = df.groupby('Department').filter(lambda x:x['Sales'].sum() > 400)
filt = df.groupby('Department').filter(lambda x:x['Sales'].sum() > 400)
filt

   Name Department Month  Sales Performance Sales_category
0  John      Sales   Jan    200        Good           Good
1  Sara      Sales   Jan    150     Average            Bad
4  John      Sales   Feb    210        Good           Good
5  Sara      Sales   Feb    160     Average            Bad

In [28]:
filter1 = df.groupby('Department').filter(lambda x:x['Sales'].sum() > 400)
filt = df.groupby('Department').filter(lambda x : x['Sales'].sum() > 400)
filt

   Name Department Month  Sales Performance Sales_category sales_cate
0  John      Sales   Jan    200        Good           Good       Good
1  Sara      Sales   Jan    150     Average            Bad        Bad
4  John      Sales   Feb    210        Good           Good       Good
5  Sara      Sales   Feb    160     Average            Bad        Bad

In [30]:
df = df.drop(columns=['sales_cate'])
df

    Name Department Month  Sales Performance Sales_category
0   John      Sales   Jan    200        Good           Good
1   Sara      Sales   Jan    150     Average            Bad
2  Alice         HR   Jan      0     Average            Bad
3    Bob         HR   Jan      0     Average            Bad
4   John      Sales   Feb    210        Good           Good
5   Sara      Sales   Feb    160     Average            Bad
6  Alice         HR   Feb      0     Average            Bad
7    Bob         HR   Feb      0     Average            Bad

In [31]:
df['Sales_cate'] = df['Sales'].apply(lambda x: "Good" if x > 170 else 'Bad')
df

    Name Department Month  Sales Performance Sales_category Sales_cate
0   John      Sales   Jan    200        Good           Good       Good
1   Sara      Sales   Jan    150     Average            Bad        Bad
2  Alice         HR   Jan      0     Average            Bad        Bad
3    Bob         HR   Jan      0     Average            Bad        Bad
4   John      Sales   Feb    210        Good           Good       Good
5   Sara      Sales   Feb    160     Average            Bad        Bad
6  Alice         HR   Feb      0     Average            Bad        Bad
7    Bob         HR   Feb      0     Average            Bad        Bad

In [32]:
fil = df.groupby('Department').filter(lambda x:x['Sales'].sum() > 400)
fil

   Name Department Month  Sales Performance Sales_category Sales_cate
0  John      Sales   Jan    200        Good           Good       Good
1  Sara      Sales   Jan    150     Average            Bad        Bad
4  John      Sales   Feb    210        Good           Good       Good
5  Sara      Sales   Feb    160     Average            Bad        Bad

In [33]:
df['sale_cate'] = df['Sales'].apply(lambda x: 'Good' if x > 170 else 'Bad')
df

,Name,Department,Month,Sales,Performance,Sales_category,Sales_cate,sale_cate
0,John,Sales,Jan,200,Good,Good,Good,Good
1,Sara,Sales,Jan,150,Average,Bad,Bad,Bad
2,Alice,HR,Jan,0,Average,Bad,Bad,Bad
3,Bob,HR,Jan,0,Average,Bad,Bad,Bad
4,John,Sales,Feb,210,Good,Good,Good,Good
5,Sara,Sales,Feb,160,Average,Bad,Bad,Bad
6,Alice,HR,Feb,0,Average,Bad,Bad,Bad
7,Bob,HR,Feb,0,Average,Bad,Bad,Bad

In [34]:
fil = df.groupby('Department').filter(lambda x: x['Sales'].sum() > 400)
fil

,Name,Department,Month,Sales,Performance,Sales_category,Sales_cate,sale_cate
0,John,Sales,Jan,200,Good,Good,Good,Good
1,Sara,Sales,Jan,150,Average,Bad,Bad,Bad
4,John,Sales,Feb,210,Good,Good,Good,Good
5,Sara,Sales,Feb,160,Average,Bad,Bad,Bad

In [35]:
df[df['Sales'] > 150]

,Name,Department,Month,Sales,Performance,Sales_category,Sales_cate,sale_cate
0,John,Sales,Jan,200,Good,Good,Good,Good
4,John,Sales,Feb,210,Good,Good,Good,Good
5,Sara,Sales,Feb,160,Average,Bad,Bad,Bad

In [ ]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score,accuracy_score,classification_report
from sklearn.linear import LinearRegression
from sklearn.ensemble import RandomForestRegressor
from sklearn.tree import DecisionTreeRegressor

x_train,y_train,x_test,y_test = train_test_split(x,y,test_size=0.2,random_state=42)
model = LinearRegression()
model.fit(x_train,y_train)
y_pred = model.predict(x_test)
acc= r2_score(x_train,y_train)

In [36]:
df

,Name,Department,Month,Sales,Performance,Sales_category,Sales_cate,sale_cate
0,John,Sales,Jan,200,Good,Good,Good,Good
1,Sara,Sales,Jan,150,Average,Bad,Bad,Bad
2,Alice,HR,Jan,0,Average,Bad,Bad,Bad
3,Bob,HR,Jan,0,Average,Bad,Bad,Bad
4,John,Sales,Feb,210,Good,Good,Good,Good
5,Sara,Sales,Feb,160,Average,Bad,Bad,Bad
6,Alice,HR,Feb,0,Average,Bad,Bad,Bad
7,Bob,HR,Feb,0,Average,Bad,Bad,Bad

In [37]:
df.drop(columns=['Sales_category','Sales_cate','sale_cate'],axis=1,inplace=True)

In [38]:
df

    Name Department Month  Sales Performance
0   John      Sales   Jan    200        Good
1   Sara      Sales   Jan    150     Average
2  Alice         HR   Jan      0     Average
3    Bob         HR   Jan      0     Average
4   John      Sales   Feb    210        Good
5   Sara      Sales   Feb    160     Average
6  Alice         HR   Feb      0     Average
7    Bob         HR   Feb      0     Average

In [39]:
fil = df.groupby('Department').filter(lambda x:x['Sales'].sum() > 400)
fil

   Name Department Month  Sales Performance
0  John      Sales   Jan    200        Good
1  Sara      Sales   Jan    150     Average
4  John      Sales   Feb    210        Good
5  Sara      Sales   Feb    160     Average

In [40]:
df['Sales_cate'] = df['Sales'].apply(lambda x:'Good' if x > 170 else 'Bad')
df

    Name Department Month  Sales Performance Sales_cate
0   John      Sales   Jan    200        Good       Good
1   Sara      Sales   Jan    150     Average        Bad
2  Alice         HR   Jan      0     Average        Bad
3    Bob         HR   Jan      0     Average        Bad
4   John      Sales   Feb    210        Good       Good
5   Sara      Sales   Feb    160     Average        Bad
6  Alice         HR   Feb      0     Average        Bad
7    Bob         HR   Feb      0     Average        Bad

In [27]:
df['sales_cate'] = df['Sales'].apply(lambda x: 'Good' if x > 170 else 'Bad')
df

    Name Department Month  Sales Performance Sales_category sales_cate
0   John      Sales   Jan    200        Good           Good       Good
1   Sara      Sales   Jan    150     Average            Bad        Bad
2  Alice         HR   Jan      0     Average            Bad        Bad
3    Bob         HR   Jan      0     Average            Bad        Bad
4   John      Sales   Feb    210        Good           Good       Good
5   Sara      Sales   Feb    160     Average            Bad        Bad
6  Alice         HR   Feb      0     Average            Bad        Bad
7    Bob         HR   Feb      0     Average            Bad        Bad

In [ ]:
# Filter groups based on total Sales
filtered = df.groupby('Department').filter(lambda x: x['Sales'].sum() > 400)
print(filtered)

In [ ]:
# Iterate over each group
for name, group in df.groupby('Department'):
    print(f"Department: {name}")
    print(group)
    print("-" * 20)

In [62]:
def fibonacci(n):
    sequence = [0, 1]
    while len(sequence) < n:
        sequence.append(sequence[-1] + sequence[-2])
    return sequence

# Example usage
print(fibonacci(10))  # Output: [0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [1]:
def fibo(n):
    seq = [0,1]
    while len(seq) < n:
        seq.append(seq[-1] + seq[-2])
    return seq
fibo(10)

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [2]:
def fibo(n):
    seq=[0,1]
    while len(seq) < n:
        seq.append(seq[-1] + seq[-2])
    return seq

fibo(10)

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [8]:
def fibo(n):
    seq=[0,1]
    while len(seq) <n:
        seq.append(seq[-1]+seq[-2])
    return seq

fibo(10)

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [4]:
def upper_string(s):
    result = ""
    st = s.lower()
    for i in range(len(st)):
        if i == 0 or i == 4:
            result += st[-(i+1)].upper()
        else:
            result += st[-(i+1)]
    return result

upper_string('macdonald')

'DlanOdcam'

In [6]:
def count_(lis):
    d = {}
    for i in lis:
        if i in d:
            d[i] += 1
        else:
            d[i] = 1
    return d

count_([1,2,3,4,1,2,3])

{1: 2, 2: 2, 3: 2, 4: 1}

In [8]:
def merge_two_list(list1,list2):
    merge_list = []
    i,j = 0,0
    while i < len(list1) and j < len(list2):
        if list1[i] < list2[j]:
            merge_list.append(list1[i])
            i+=1
        else:
            merge_list.append(list2[j])
            j+=1
    merge_list.extend(list1[i:])
    merge_list.extend(list2[j:])
    return merge_list

merge_two_list([1,2,3],[4,5,6])

[1, 2, 3, 4, 5, 6]

In [9]:
def flatten_list(nested_list):
    flat_list = []
    for i in nested_list:
        if isinstance(i,list):
            flat_list.extend(flatten_list(i))
        else:
            flat_list.append(i)
    return flat_list

flatten_list([1,2,[2,3,[3,3,[5,3], [6,9,0]]]])

[1, 2, 2, 3, 3, 3, 5, 3, 6, 9, 0]

In [10]:
def remove_dup(lis):
    lis.sort()
    i = 1
    while i < len(lis):
        if lis[i] == lis[i-1]:
            del lis[i]
        else:
            i+=1
    return lis

remove_dup([1,2,3,1,2,34,4,5,3,2])

[1, 2, 3, 4, 5, 34]

In [11]:
def fact(n):
    if n == 0:
        return 1
    return n * fact(n-1)
fact(5)

120

In [12]:
def fibo(n):
    seq=[0,1]
    while len(seq) < n:
        seq.append(seq[-1]+seq[-2])
    return seq

fibo(10)

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [65]:
def factorial(n):
    if n == 0:
        return 1
    return n * factorial(n - 1)

# Example usage
print(factorial(5))  # Output: 120

120

In [14]:
def fact(n):
    if n == 0:
        return 1
    return n * fact(n-1)

fact(5)

120

In [69]:
def is_prime(n):
    if n <= 1:
        return False
    for i in range(2, int(n**0.5) + 1):
        if n % i == 0:
            return False
    return True

# Example usage
print(is_prime(11))  # Output: True
print(is_prime(4))   # Output: False

True
False

In [73]:
def prime(n):
    if n <= 1:
        return False
    for i in range(2, int(n**0.5) +1):
        if n%i==0:
            return False
    return True

prime(11)

True

In [74]:
def remove_duplicates(lst):
    return list(set(lst))

# Example usage
print(remove_duplicates([1, 2, 2, 3, 4, 4]))  # Output: [1, 2, 3, 4]

[1, 2, 3, 4]

In [112]:
lst = [1, 2, 2, 3, 4, 4]
l1 = []
for i in lst:
    if i in l1:
        pass
    else:
        l1.append(i)
#     print(i)

In [113]:
l1

[1, 2, 3, 4]

In [114]:
l2 = [i for i in lst if i not in lst]

In [115]:
l2

[]

In [78]:
def common_elements(lst1, lst2):
    return list(set(lst1) & set(lst2))

# Example usage
print(common_elements([1, 2, 3, 4], [3, 4, 5, 6]))  # Output: [3, 4]

[3, 4]

In [79]:
l1 = [1,2,3,4]
l2 = [3,4,5,6]
l3 = []
for i in l1:
    for j in l2:
        if i == j:
            l3.append(i)

In [80]:
l3

[3, 4]

In [81]:
def flatten_list(nested_list):
    flat_list = []
    for item in nested_list:
        if isinstance(item, list):
            flat_list.extend(flatten_list(item))
        else:
            flat_list.append(item)
    return flat_list

# Example usage
print(flatten_list([1, [2, [3, 4]], 5]))  # Output: [1, 2, 3, 4, 5]

[1, 2, 3, 4, 5]

In [82]:
def second_largest(lst):
    unique_lst = list(set(lst))  # Remove duplicates
    unique_lst.sort()            # Sort the list
    return unique_lst[-2] if len(unique_lst) >= 2 else None  # Return second largest or None

# Example usage
lst = [5, 3, 9, 7, 9, 3]
print(second_largest(lst))  # Output: 7

7

In [ ]:
def sec(lst):
    uniq = list(set(lst))
    uniq.sort()

In [15]:
lis = [11,22,33,44]
largest = second_largest = 0
for i in lis:
    if i > largest:
        second_largest = largest
        largest = i
    elif i > second_largest and i != largest:
        second_largest = i
print(second_largest)

33

In [18]:
smallest = second_smallest = float('inf')
for i in lis:
    if i < smallest:
        smallest,second_smallest = i,smallest
    elif i < second_smallest:
        second_smallest = i
print(second_smallest)

22

In [83]:
def second_largest(lst):
    if len(lst) < 2:
        return None  # Not enough elements for a second largest

    largest = second_largest = float('-inf')  # Initialize to negative infinity

    for num in lst:
        if num > largest:
            second_largest = largest  # Update second largest
            largest = num  # Update largest
        elif largest > num > second_largest:  # Ensure the number is not equal to the largest
            second_largest = num

    return second_largest if second_largest != float('-inf') else None  # Return None if no second largest

# Example usage
lst = [5, 3, 9, 7, 9, 3]
print(second_largest(lst))  # Output: 7

7

In [90]:
def sec_lar(lst):
    if len(lst) < 2:
        return None
    largest = sec_larg = float('-inf')
    for num in lst:
        if num > largest:
            sec_larg = largest
            largest = num
        elif largest >num >sec_larg:
            sec_larg = num
    return sec_larg if sec_lar != float('-inf') else None

In [91]:
# Example usage
lst = [5, 3, 9, 7, 9, 3]
print(sec_lar(lst))

7

In [92]:
def find_index(lst, element):
    if element in lst:
        return lst.index(element)
    return -1  # Return -1 if the element is not found

# Example usage
lst = [1, 2, 3, 4, 5]
print(find_index(lst, 3))  # Output: 2

2

In [96]:
def find_index(lst,element):
    if element in lst:
        return lst.index(element)
    return -1

lst = [1, 2, 3, 4, 5]
print(find_index(lst, 3))  # Output: 2

2

In [97]:
def sum_of_digits(n):
    return sum(int(digit) for digit in str(n))

# Example usage
print(sum_of_digits(12345))  # Output: 15

15

In [99]:
def sum_digit(n):
    return sum(int(digit) for digit in str(n))
print(sum_digit(12345))  # Output: 15

15

In [100]:
def nth_fibonacci(n):
    a, b = 0, 1
    for _ in range(n):
        a, b = b, a + b
    return a

# Example usage
print(nth_fibonacci(10))  # Output: 55

55

In [103]:
def fibo(n):
    seq = [0,1]
    while len(seq) < n:
        seq.append(seq[-1]+seq[-2])
    return seq
fibo(10)

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [ ]:
import numpy as np
import tensorflow as tf
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense

model = Sequential()
model.add(Dense(64,activation='relu',input_dim=30))
model.add(Dense(32, activation='relu'))
model.add(Dense(1, activation='sigmoid'))
model.compile(optimizer='adam',loss = 'binary_crossentropy',metrics=['accuracy'])
model.summary()
model.fit(X_train,Y_train, batch_size=16, epochs=10, validation_data=(X_test,y_test))
loss, accuracy = model.evaluate(X_test,y_test)

In [ ]:
import tensorflow as tf
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense

model = Sequential()
model.add(Dense(64,activation='relu',input_dim=30))
model.add(Dense(32,activation='relu'))
model.add(Dense(1,activation='sigmoid'))
model.compile(optimizer='adam',loss='binary_crossentropy',metrics=['accuracy'])
model.fit(x_train,y_train, batch_sizes = 16, epochs=10, validation_data=(x_test,y_test))
model.summary()
loss,accuracy = model.evaluate(x_test,y_test)

In [ ]:
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense,Flatten,BatchNormalization,Dropout,Conv2D,Maxpooling2D

model.Sequential()
model.add(Conv2D(32,kernel_size=(3,3),padding='valid',activation='relu',input_shape=(224,224,3)))
model.add(Conv2D(32,kernel_size=(3,3),padding='valid',activation='relu',input_shape=(224,224,3)))
model.add(BatchNormalizartion())
model.add(MaxPooling2D(pool_size=(2,2),stride=2,padding='valid'))
model.add(Flatten)
model.add(Dense(128,activation='relu'))
model.Dropout(0.5)
model.add(Dense(1,activation='sigmoid'))
model.compile(optimizer='adam',loss='binary_crossentropy',metrics=['accuracy'])
model.fit(x_train_ds,epochs=10,batch_size = 32,validation_data=validation_ds)

In [ ]:
#Simple CNN
import tensorflow as tf
from  tensorflow import keras
from keras import Sequential
from keras.layers import Dense, Conv2D, MaxPooling2D, Flatten,BatchNormalization,Dropout
model = Sequential()

model.add(Conv2D(32,kernel_size=(3,3),padding='valid',activation='relu',input_shape=(256,256,3)))
model.add(BatchNormalization())
model.add(MaxPooling2D(pool_size=(2,2),strides=2,padding='valid'))

model.add(Flatten())

model.add(Dense(128,activation='relu'))
model.add(Dropout(0.1))

model.add(Dense(1,activation='sigmoid'))

model.compile(optimizer='adam',loss='binary_crossentropy',metrics=['accuracy'])

history = model.fit(train_ds,epochs=10,validation_data=validation_ds)

In [ ]:
import tensorflow as tf
from tf.keras.models import Sequential
from tf.keras.layers import Dense, Conv2D, MaxPooling2D,Flattern, BatchNormalization,Dropout
from tf.keras.layers import Dense, Conv2D, MaxPooling2D, Flattern, BatchNormalization, Dropout

model = Sequential()
model.add(Conv2D(32,kernel_size=(3,3),padding='valid',activation='relu',input_shape=(224,224,3)))
model.add(BatchNormalization())
model.add(MaxPooling2D(pool_size=(2,2),stride=2,padding='valid'))
model.add(Flattern())
model.add(Dense(128,activation='relu'))
model.add(Dropout(0.2))
model.add(Dense(1,activation='sigmoid'))

In [ ]:
# Step 1: Import necessary libraries
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.datasets import load_iris

# Step 2: Import models
from sklearn.ensemble import RandomForestClassifier  # Random Forest
from sklearn.neighbors import KNeighborsClassifier   # K-Nearest Neighbors
from sklearn.tree import DecisionTreeClassifier      # Decision Tree
from sklearn.svm import SVC                          # Support Vector Machine

# Step 3: Load dataset (we'll use the iris dataset for simplicity)
data = load_iris()
X = pd.DataFrame(data.data, columns=data.feature_names)  # Features
y = pd.Series(data.target)  # Target variable

# Step 4: Split the data into training

In [ ]:
from skclearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error,r2_score,accuracy_score
from sklearn.tree import DecisionTreeClassifier
from sklearn.linear_model import LenearRegression
from sklearn.svm import SVC
from sklearn.neighbors import KNeighborsClassifier

x_train,y_train,x_test,y_test = train_test_split(X,Y,test_size=0.2,random_state=42)
model = LinearRegression()
model.fit(x_train,y_train)
y_pred = model.predict(x_test)
mse = mean_squared_error(y_test,y_pred)

In [ ]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error, r2_score, accuracy_score, classification_report
from sklearn.tree import DecisionTreeRegressor
from sklearn.linear import LinearRegression
from sklearn.enseble import RandomForestRegressor
from xgboost import XGBRegressor

x_train,y_train,x_test,y_test = train_test_split(x,y,test_size=0.3,random_test=42)
model = LinearRegression()
model.fit(x_train,y_train)
y_pred = model.predict(x_test)
mse = mean_squared_error(y_test,y_pred)
accuracy = r2_score(x_test,y_test)

In [ ]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error, r2_score,accuracy_score
from sklearn.linear import LinearRegression
from sklearn.tree import DecisionTreeRegression
from sklearn.ensemble import RandomForestClassifier
x_train,y_train,x_test,y_test = train_test_split(x,y,test_size=0.2,random_state=42)
model = LinearRegression()
model.fit(x_train,y_train)
y_pred = model.predict(x_test)
r2_sco = r2_score(x_test,y_test)

In [ ]:
# List of columns with null values that you want to fill
columns_to_fill = data1.columns[data1.isnull().any()].tolist()

# Fill null values with the mean for numeric columns and mode for object columns
for column in columns_to_fill:
    if data1[column].dtype == 'object':
        data1[column] = data1[column].fillna(data1[column].mode()[0])
    elif data1[column].dtype in ['int64', 'float64']:
        data1[column] = data1[column].fillna(data1[column].mean())
        
# List of columns to encode
df_cols = data1.select_dtypes(include=['object']).columns
le = LabelEncoder()
for column in df_cols:
    if data1[column].dtype == 'object':
        data1[column] = le.fit_transform(data1[column])
        
        
# import zscore 
from scipy.stats import zscore
z_score = zscore(data[['weight','ball_controlling_skills','body_reflexes','body_balance','jumping_skills','max_running_speed','goalkeeping_skills','mental_strength','fitness_rating','behaviour_rating','body_strength_stamina']])
abs_z_score = np.abs(z_score)    
filtering_entry = (abs_z_score  < 3).all(axis=1) 
df = data[filtering_entry]

In [ ]:
# Save this code as `classification_pipeline.py`

import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from xgboost import XGBClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import classification_report
import joblib

class ClassificationPipeline:
    def __init__(self, data, target_column):
        self.data = data
        self.target_column = target_column
        self.models = {
            "RandomForest": RandomForestClassifier(random_state=42),
            "XGBoost": XGBClassifier(random_state=42),
            "LogisticRegression": LogisticRegression(max_iter=1000)
        }
        self.trained_models = {}

    def prepare_data(self):
        X = self.data.drop(columns=self.target_column)
        y = self.data[self.target_column]
        return train_test_split(X, y, test_size=0.2, random_state=42)

    def train_and_evaluate(self, X_train, X_test, y_train, y_test):
        for model_name, model in self.models.items():
            model.fit(X_train, y_train)
            y_pred = model.predict(X_test)
            print(f"{model_name} Classification Report:")
            print(classification_report(y_test, y_pred))
            print("\n")
            self.trained_models[model_name] = model

    def save_models(self):
        for model_name, model in self.trained_models.items():
            joblib.dump(model, f"{model_name.lower()}_classifier.pkl")

    def load_model(self, model_name):
        return joblib.load(f"{model_name.lower()}_classifier.pkl")

    def predict_on_new_data(self, new_data):
        predictions = {}
        for model_name in self.models.keys():
            model = self.load_model(model_name)
            predictions[f"{model_name} Prediction"] = model.predict(new_data)
        return predictions

# Main script
if __name__ == "__main__":
    # Load data (replace with your dataset path)
    # Example: df = pd.read_csv('your_dataset.csv')
    df = pd.DataFrame()  # Replace with your data
    target_column = 'target_column'  # Replace with your actual target column name

    # Initialize the pipeline
    pipeline = ClassificationPipeline(data=df, target_column=target_column)

    # Prepare data
    X_train, X_test, y_train, y_test = pipeline.prepare_data()

    # Train and evaluate models
    pipeline.train_and_evaluate(X_train, X_test, y_train, y_test)

    # Save models
    pipeline.save_models()

    # Example: Predict on new data
    # Replace 'new_data' with actual new data as a DataFrame
    new_data = pd.DataFrame()  # Example placeholder, replace with your new data
    predictions = pipeline.predict_on_new_data(new_data)
    print("Predictions on new data:", predictions)

In [ ]:
# Step 1: Import necessary libraries
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error, r2_score

# Step 2: Load a dataset (we're using a built-in dataset from sklearn)
from sklearn.datasets import load_diabetes
data = load_diabetes()

# Step 3: Prepare the data
X = pd.DataFrame(data.data, columns=data.feature_names)  # Features
y = pd.Series(data.target)  # Target variable (disease progression)

# Step 4: Split the data into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Step 5: Initialize and train the model (Linear Regression in this case)
model = LinearRegression()
model.fit(X_train, y_train)

# Step 6: Make predictions on the test set
y_pred = model.predict(X_test)

# Step 7: Evaluate the model performance
mse = mean_squared_error(y_test, y_pred)
r2 = r2_score(y_test, y_pred)

# Step 8: Print the evaluation results
print(f"Mean Squared Error: {mse}")
print(f"R-Squared: {r2}")

# Optional: Print the model coefficients
print("Model Coefficients:", model.coef_)

In [ ]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.ensemble import RandomForestRegressor, XGBRegressor
from sklearn.metrics import r2_score,mean_squared_error, accuracy_score

In [ ]:
# Save this code as `classification_with_report.py`

import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from xgboost import XGBClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import classification_report
import joblib

# Load data (replace with your dataset path)
# Example: df = pd.read_csv('your_dataset.csv')
df = pd.DataFrame()  # Replace with your data

# Define target and features
X = df.drop(columns='target_column')  # Replace 'target_column' with your actual target column name
y = df['target_column']  # Replace with your actual target column name

# Split the dataset
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Define a function to train, predict and print classification report for a model
def evaluate_model(model, X_train, X_test, y_train, y_test):
    model.fit(X_train, y_train)
    y_pred = model.predict(X_test)
    
    print(f"{model.__class__.__name__} Classification Report:")
    print(classification_report(y_test, y_pred))
    print("\n")
    
    return model

# Initialize models
rf_model = RandomForestClassifier(random_state=42)
xgb_model = XGBClassifier(random_state=42)
lr_model = LogisticRegression(max_iter=1000)

# Evaluate and save each model
rf_model = evaluate_model(rf_model, X_train, X_test, y_train, y_test)
xgb_model = evaluate_model(xgb_model, X_train, X_test, y_train, y_test)
lr_model = evaluate_model(lr_model, X_train, X_test, y_train, y_test)

# Save the trained models
joblib.dump(rf_model, 'random_forest_classifier.pkl')
joblib.dump(xgb_model, 'xgboost_classifier.pkl')
joblib.dump(lr_model, 'logistic_regression_classifier.pkl')

# Function to load models and make predictions on new data
def predict_on_new_data(new_data):
    # Load models
    rf_model = joblib.load('random_forest_classifier.pkl')
    xgb_model = joblib.load('xgboost_classifier.pkl')
    lr_model = joblib.load('logistic_regression_classifier.pkl')
    
    # Make predictions
    rf_pred = rf_model.predict(new_data)
    xgb_pred = xgb_model.predict(new_data)
    lr_pred = lr_model.predict(new_data)
    
    predictions = {
        "Random Forest Prediction": rf_pred,
        "XGBoost Prediction": xgb_pred,
        "Logistic Regression Prediction": lr_pred
    }
    
    return predictions

# Example: Predict on new data
# Replace 'new_data' with actual new data as a DataFrame
new_data = pd.DataFrame()  # Example placeholder, replace with your new data
predictions = predict_on_new_data(new_data)
print("Predictions on new data:", predictions)

In [ ]:
a = data['Income'].value_counts() # count the data of income and store it in variavle "a"
plt.figure(figsize=(3,3)) # figure size
a.plot.pie(autopct="%1.1f%%") # plot pie plot
plt.show()

In [2]:
import seaborn as sns
import matplotlib.pyplot as plt

In [ ]:
a = data['income'].value_counts()
plt.figure(figsize=(3,3))
a.plot.pie(autopct="%1.1f%%")
plt.show

In [ ]:
plt.figure(figsize=(12,12))
sns.countplot(x='workclass',data=data)
plt.show

In [ ]:
plt.figure(figsize=(12,12))
sns.boxplot(x='income',y='age',data=data)
plt.show

In [ ]:
plt.figure(figsize=(12,12))
sns.barplot(x,y,data=data)
plt.show()

In [ ]:
sns.distplot()